# Parameter Type Id Rebar Termination Rotation At Start Property

Source: https://www.revitapidocs.com/2026/e47ceb73-c237-2843-96ab-8521111f61d2.htm

---

| Parameter Type Id Rebar Termination Rotation At Start Property |
| --- |

"Rotation At Start"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarTerminationRotationAtStart { get; }
```

```
Public Shared ReadOnly Property RebarTerminationRotationAtStart As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarTerminationRotationAtStart {
	ForgeTypeId^ get ();
}
```

```
static member RebarTerminationRotationAtStart : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace